KubaJ24/STM32_ADC/Inc/main.h
/*
 * main.h
 *
 *  Created on: Nov 19, 2023
 *      Author: ahadz
 */

#ifndef MAIN_H_
#define MAIN_H_

#include <stdint.h>
#include "stm32f746xx.h"

#define CONV_IN_PROG	!(ADC_SR_EOC)
#define ADC_START		ADC1->CR2 |= ADC_CR2_SWSTART
#define ADC_ON			ADC1->CR2 |= ADC_CR2_ADON
#define DMA_ENABLE		DMA2_Stream0->CR |= (1 << 0)
#define DMA_PER_ADD 	DMA2_Stream0->PAR = (uint32_t) &ADC1->DR
#define DMA_ITEM_NUM	DMA2_Stream0->NDTR = 10		//10 ITEMS TO TRANSFER
//#define DMA_MEM_ADD		DMA2_Stream0->M0AR = 		//DATA ADDRESS

void ADC_CONF(void);
void DMA_CONF(void);
void ADC_DMA_ENABLE(void);

void ADC_CONF(void){
	//GPIOA CLOCK ENABLE
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
	//ADC1 CLOCK ENABLE
	RCC->APB2ENR |= RCC_APB2ENR_ADC1EN;

	//PA3 ANALOG INPUT MODE
	GPIOA->MODER |= GPIO_MODER_MODER3_0 | GPIO_MODER_MODER3_1;

	//ADC PRESCALLER -> 8
	//FREQUENCY OF PCLK2 / 8 = 16MHZ / 8 = 2MHZ
	ADC->CCR |= ADC_CCR_ADCPRE_0 | ADC_CCR_ADCPRE_1;
	//10 BIT RESOLUTION (0 - 1024)
	ADC1->CR1 |= ADC_CR1_RES_0;
	//EOC ENABLED (END OF CONVERSION)
	ADC1->CR2 |= ADC_CR2_EOCS;
	//RIGHT DATA ALIGNMENT
	ADC1->CR2 &= ~(ADC_CR2_ALIGN);
	//SCAN MODE
	ADC1->CR1 |= ADC_CR1_SCAN;
	//SEQUENCE OF ONE CHANNEL
	ADC1->SQR3 |= 4;
	//CONTINUOUS MODE
	ADC1->CR2 |= ADC_CR2_CONT;
	//28 CYCLES SAMPLE TIME
	ADC1->SMPR2 |= ADC_SMPR2_SMP4_1;
}

void DMA_CONF(void){
	//ADC1 -> DMA2 STREAM 0 CHANNEL 0

	//DMA2 CLOCK ENABLE
	RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;

	//DMA STREAM DISABLED
	DMA2_Stream0->CR &= ~(1 << 0);

	//MEMORY SIZE 16 BIT
	DMA2_Stream0->CR |= (1 << 13);
	//PEIPHERAL DATA SIZE
	DMA2_Stream0->CR |= (1 << 11);
	//MEMORY INCREMENT
	DMA2_Stream0->CR |= (1 << 10);
	//CIRCULAR MODE
	DMA2_Stream0->CR |= (1 << 8);
}

void ADC_DMA_ENABLE(void){
	//DMA ENABLE
	ADC1->CR2 |= ADC_CR2_DMA;
	//DMA CONTINUOUS REQUEST - DDS
	ADC1->CR2 |= ADC_CR2_DDS;
}

#endif /* MAIN_H_ */
